Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.AccessControlListEntryDto
Represents an entry in the access control list for a BIM model, associating a principal with an access level.
Note: Model ID and creation info have been removed from this DTO as they are not needed for the UI.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.AccessControlListEntryDto.PrincipalId
The principal identifier in CURIE (Compact Uniform Resource Identifier) format.
Example: "user:example_user@email.com"
"organization:organizationId"
"group:groupId"

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.AccessControlListEntryDto.AccessLevel
Gets or sets the access level assigned to the principal.
Values can be "read", "write", or "admin".
Case sensitive.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.AccessControlListEntryDto.ModelId
Gets or sets the model identifier to which this access control entry applies.